; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-7nodes-1000size-4degree-100mindistance-2trucks-4packages-904seed

(define (problem transport-two-cities-sequential-7nodes-1000size-4degree-100mindistance-2trucks-4packages-904seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  city-1-loc-7 - location
  city-2-loc-7 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 927,522 -> 797,998
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 50)
  ; 797,998 -> 927,522
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 50)
  ; 84,389 -> 42,503
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 13)
  ; 42,503 -> 84,389
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 13)
  ; 487,778 -> 797,998
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 38)
  ; 797,998 -> 487,778
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 38)
  ; 487,778 -> 927,522
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 51)
  ; 927,522 -> 487,778
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 51)
  ; 473,498 -> 927,522
  (road city-1-loc-6 city-1-loc-2)
  (= (road-length city-1-loc-6 city-1-loc-2) 46)
  ; 927,522 -> 473,498
  (road city-1-loc-2 city-1-loc-6)
  (= (road-length city-1-loc-2 city-1-loc-6) 46)
  ; 473,498 -> 42,503
  (road city-1-loc-6 city-1-loc-3)
  (= (road-length city-1-loc-6 city-1-loc-3) 44)
  ; 42,503 -> 473,498
  (road city-1-loc-3 city-1-loc-6)
  (= (road-length city-1-loc-3 city-1-loc-6) 44)
  ; 473,498 -> 84,389
  (road city-1-loc-6 city-1-loc-4)
  (= (road-length city-1-loc-6 city-1-loc-4) 41)
  ; 84,389 -> 473,498
  (road city-1-loc-4 city-1-loc-6)
  (= (road-length city-1-loc-4 city-1-loc-6) 41)
  ; 473,498 -> 487,778
  (road city-1-loc-6 city-1-loc-5)
  (= (road-length city-1-loc-6 city-1-loc-5) 28)
  ; 487,778 -> 473,498
  (road city-1-loc-5 city-1-loc-6)
  (= (road-length city-1-loc-5 city-1-loc-6) 28)
  ; 490,137 -> 84,389
  (road city-1-loc-7 city-1-loc-4)
  (= (road-length city-1-loc-7 city-1-loc-4) 48)
  ; 84,389 -> 490,137
  (road city-1-loc-4 city-1-loc-7)
  (= (road-length city-1-loc-4 city-1-loc-7) 48)
  ; 490,137 -> 473,498
  (road city-1-loc-7 city-1-loc-6)
  (= (road-length city-1-loc-7 city-1-loc-6) 37)
  ; 473,498 -> 490,137
  (road city-1-loc-6 city-1-loc-7)
  (= (road-length city-1-loc-6 city-1-loc-7) 37)
  ; 2021,214 -> 2047,53
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 17)
  ; 2047,53 -> 2021,214
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 17)
  ; 2414,10 -> 2047,53
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 37)
  ; 2047,53 -> 2414,10
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 37)
  ; 2414,10 -> 2021,214
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 45)
  ; 2021,214 -> 2414,10
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 45)
  ; 2414,10 -> 2617,121
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 24)
  ; 2617,121 -> 2414,10
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 24)
  ; 2018,588 -> 2021,214
  (road city-2-loc-6 city-2-loc-2)
  (= (road-length city-2-loc-6 city-2-loc-2) 38)
  ; 2021,214 -> 2018,588
  (road city-2-loc-2 city-2-loc-6)
  (= (road-length city-2-loc-2 city-2-loc-6) 38)
  ; 2834,287 -> 2617,121
  (road city-2-loc-7 city-2-loc-3)
  (= (road-length city-2-loc-7 city-2-loc-3) 28)
  ; 2617,121 -> 2834,287
  (road city-2-loc-3 city-2-loc-7)
  (= (road-length city-2-loc-3 city-2-loc-7) 28)
  ; 2834,287 -> 2414,10
  (road city-2-loc-7 city-2-loc-4)
  (= (road-length city-2-loc-7 city-2-loc-4) 51)
  ; 2414,10 -> 2834,287
  (road city-2-loc-4 city-2-loc-7)
  (= (road-length city-2-loc-4 city-2-loc-7) 51)
  ; 2834,287 -> 2955,584
  (road city-2-loc-7 city-2-loc-5)
  (= (road-length city-2-loc-7 city-2-loc-5) 33)
  ; 2955,584 -> 2834,287
  (road city-2-loc-5 city-2-loc-7)
  (= (road-length city-2-loc-5 city-2-loc-7) 33)
  ; 927,522 <-> 2018,588
  (road city-1-loc-2 city-2-loc-6)
  (= (road-length city-1-loc-2 city-2-loc-6) 110)
  (road city-2-loc-6 city-1-loc-2)
  (= (road-length city-2-loc-6 city-1-loc-2) 110)
  (at package-1 city-1-loc-7)
  (at package-2 city-1-loc-3)
  (at package-3 city-1-loc-7)
  (at package-4 city-1-loc-3)
  (at truck-1 city-2-loc-7)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-7)
  (at package-2 city-2-loc-5)
  (at package-3 city-2-loc-5)
  (at package-4 city-2-loc-7)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 4
2. (drive truck-2 city-2-loc-2 city-2-loc-6)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-6)
   goals met: 0 of 4
3. (drive truck-2 city-2-loc-6 city-1-loc-2)
   deleted: (at truck-2 city-2-loc-6)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 4
4. (drive truck-2 city-1-loc-2 city-1-loc-6)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-6)
   goals met: 0 of 4
5. (drive truck-2 city-1-loc-6 city-1-loc-7)
   deleted: (at truck-2 city-1-loc-6)
   added: (at truck-2 city-1-loc-7)
   goals met: 0 of 4
6. (pick-up truck-2 city-1-loc-7 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-1-loc-7) (capacity truck-2 capacity-3)
   added: (in package-3 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 4
7. (pick-up truck-2 city-1-loc-7 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-1-loc-7) (capacity truck-2 capacity-2)
   added: (in package-1 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 4
8. (drive truck-2 city-1-loc-7 city-1-loc-6)
   deleted: (at truck-2 city-1-loc-7)
   added: (at truck-2 city-1-loc-6)
   goals met: 0 of 4
9. (drive truck-2 city-1-loc-6 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-6)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 4
10. (drive truck-2 city-1-loc-2 city-2-loc-6)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-2-loc-6)
   goals met: 0 of 4
11. (drive truck-2 city-2-loc-6 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-6)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 4
12. (drive truck-2 city-2-loc-2 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-4)
   goals met: 0 of 4
13. (drive truck-2 city-2-loc-4 city-2-loc-7)
   deleted: (at truck-2 city-2-loc-4)
   added: (at truck-2 city-2-loc-7)
   goals met: 0 of 4
14. (drop truck-2 city-2-loc-7 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-2-loc-7) (capacity truck-2 capacity-2)
   goals met: 1 of 4
15. (drive truck-2 city-2-loc-7 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-7)
   added: (at truck-2 city-2-loc-4)
   goals met: 1 of 4
16. (drive truck-2 city-2-loc-4 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-4)
   added: (at truck-2 city-2-loc-2)
   goals met: 1 of 4
17. (drive truck-2 city-2-loc-2 city-2-loc-6)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-6)
   goals met: 1 of 4
18. (drive truck-2 city-2-loc-6 city-1-loc-2)
   deleted: (at truck-2 city-2-loc-6)
   added: (at truck-2 city-1-loc-2)
   goals met: 1 of 4
19. (drive truck-2 city-1-loc-2 city-1-loc-6)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-6)
   goals met: 1 of 4
20. (drive truck-2 city-1-loc-6 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-6)
   added: (at truck-2 city-1-loc-3)
   goals met: 1 of 4
21. (pick-up truck-2 city-1-loc-3 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-3) (capacity truck-2 capacity-2)
   added: (in package-4 truck-2) (capacity truck-2 capacity-1)
   goals met: 1 of 4
22. (pick-up truck-2 city-1-loc-3 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-1-loc-3) (capacity truck-2 capacity-1)
   added: (in package-2 truck-2) (capacity truck-2 capacity-0)
   goals met: 1 of 4
23. (drive truck-2 city-1-loc-3 city-1-loc-6)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-6)
   goals met: 1 of 4
24. (drive truck-2 city-1-loc-6 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-6)
   added: (at truck-2 city-1-loc-2)
   goals met: 1 of 4
25. (drive truck-2 city-1-loc-2 city-2-loc-6)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-2-loc-6)
   goals met: 1 of 4
26. (drive truck-2 city-2-loc-6 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-6)
   added: (at truck-2 city-2-loc-2)
   goals met: 1 of 4
27. (drive truck-2 city-2-loc-2 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-4)
   goals met: 1 of 4
28. (drive truck-2 city-2-loc-4 city-2-loc-7)
   deleted: (at truck-2 city-2-loc-4)
   added: (at truck-2 city-2-loc-7)
   goals met: 1 of 4
29. (drop truck-2 city-2-loc-7 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-0)
   added: (at package-4 city-2-loc-7) (capacity truck-2 capacity-1)
   goals met: 2 of 4
30. (drive truck-2 city-2-loc-7 city-2-loc-5)
   deleted: (at truck-2 city-2-loc-7)
   added: (at truck-2 city-2-loc-5)
   goals met: 2 of 4
31. (drop truck-2 city-2-loc-5 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-1)
   added: (at package-2 city-2-loc-5) (capacity truck-2 capacity-2)
   goals met: 3 of 4
32. (drop truck-2 city-2-loc-5 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-2)
   added: (at package-3 city-2-loc-5) (capacity truck-2 capacity-3)
   goals met: 4 of 4
